04_OpenFoam/_ref/OpenFOAM-14/compressibleMultiphaseVoF/damBreak4phaseLaminar/constant/physicalProperties.mercury
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.mercury;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   200.59;
    }
    equationOfState
    {
        rho         13529;
    }
    thermodynamics
    {
        Cv          139;
        hf          0;
    }
    transport
    {
        mu          1.522e-3;
        Pr          0.022;
    }
}


// ************************************************************************* //
