04_OpenFoam/_ref/OpenFOAM-14/compressibleMultiphaseVoF/damBreak4phaseLaminar/constant/physicalProperties.oil
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.oil;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   100.21;
    }
    equationOfState
    {
        rho         684;
    }
    thermodynamics
    {
        Cv          2240;
        hf          0;
    }
    transport
    {
        mu          3.76e-4;
        Pr          6;
    }
}


// ************************************************************************* //
