04_OpenFoam/_ref/OpenFOAM-14/compressibleMultiphaseVoF/damBreak4phaseLaminar/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField
{
    type        zonal;

    defaultValue    0;

    zones
    {
        water
        {
            type        box;

            box         (0 0.1 -1) (0.1461 0.292 1);

            value       1;
        }
    }
}

boundaryField
{
    leftWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
    }

    rightWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
    }

    lowerWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            mercury         { theta0 90; }
        }
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
